In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data=pd.read_csv("C:/Users/pavankadari/Downloads/14.FDNY.csv")
data

,FacilityName,FacilityAddress,Borough
0,FacilityName,FacilityAddress,Borough
1,Engine 4/Ladder 15,42 South Street,Manhattan
2,Engine 10/Ladder 10,124 Liberty Street,Manhattan
3,Engine 6,49 Beekman Street,Manhattan
4,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan
...,...,...,...
214,Engine 162/Ladder 82/Battalion 23,256 Nelson Avenue,Staten Island
215,Engine 167/Ladder 87,345 Annadale Road,Staten Island
216,Engine 164/Ladder 84,1560 Drumgoole Road West,Staten Island
217,Engine 168/EMS Station 23,1100 Rossville Avenue,Staten Island
218,Engine 151/Ladder 76,7219 Amboy Road,Staten Island

In [4]:
data.info()
#view the content of the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 219 entries, 0 to 218
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   FacilityName     219 non-null    object
 1   FacilityAddress  219 non-null    object
 2   Borough          219 non-null    object
dtypes: object(3)
memory usage: 5.3+ KB

In [5]:
data.head()
#view the first five records of the data

,FacilityName,FacilityAddress,Borough
0,FacilityName,FacilityAddress,Borough
1,Engine 4/Ladder 15,42 South Street,Manhattan
2,Engine 10/Ladder 10,124 Liberty Street,Manhattan
3,Engine 6,49 Beekman Street,Manhattan
4,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan

In [6]:
import numpy as np

In [7]:
data.describe()

        FacilityName  FacilityAddress   Borough
count            219              219       219
unique           219              219         6
top     FacilityName  FacilityAddress  Brooklyn
freq               1                1        66

In [8]:
data.columns
#view the attributes of the dataset(column names)

Index(['FacilityName', 'FacilityAddress', 'Borough'], dtype='object')

In [9]:
data.info('Borough')
#view fdny information of each borough

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 219 entries, 0 to 218
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   FacilityName     219 non-null    object
 1   FacilityAddress  219 non-null    object
 2   Borough          219 non-null    object
dtypes: object(3)
memory usage: 5.3+ KB

In [10]:
data.index
#view the index of the dataset

RangeIndex(start=0, stop=219, step=1)

In [11]:
data.drop_duplicates()
#skip the duplicate header rows

,FacilityName,FacilityAddress,Borough
0,FacilityName,FacilityAddress,Borough
1,Engine 4/Ladder 15,42 South Street,Manhattan
2,Engine 10/Ladder 10,124 Liberty Street,Manhattan
3,Engine 6,49 Beekman Street,Manhattan
4,Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...,100-104 Duane Street,Manhattan
...,...,...,...
214,Engine 162/Ladder 82/Battalion 23,256 Nelson Avenue,Staten Island
215,Engine 167/Ladder 87,345 Annadale Road,Staten Island
216,Engine 164/Ladder 84,1560 Drumgoole Road West,Staten Island
217,Engine 168/EMS Station 23,1100 Rossville Avenue,Staten Island
218,Engine 151/Ladder 76,7219 Amboy Road,Staten Island

In [12]:
data=data.value_counts()
data

FacilityName                        FacilityAddress             Borough
  Engine 96/Ladder 54               1689 Story Avenue           Bronx        1
Engine 43/Ladder 59                 1901 Sedgwick Avenue        Bronx        1
Engine 330/Ladder 172               2312 65th Street            Brooklyn     1
Engine 331/Ladder 173               158-57 Cross Bay Boulevard  Queens       1
Engine 332/Ladder 175               165 Bradford Street         Brooklyn     1
                                                                            ..
Engine 258/Ladder 115               10-40 47th Avenue           Queens       1
Engine 259/Ladder 128/Battalion 45  33-51 Greenpoint Avenue     Queens       1
Engine 26                           220 West 37th Street        Manhattan    1
Engine 260                          11-15 37th Avenue           Queens       1
Squad 61/Battalion 20               1518 Williamsbridge Road    Bronx        1
Length: 219, dtype: int64

In [13]:
data

FacilityName                        FacilityAddress             Borough
  Engine 96/Ladder 54               1689 Story Avenue           Bronx        1
Engine 43/Ladder 59                 1901 Sedgwick Avenue        Bronx        1
Engine 330/Ladder 172               2312 65th Street            Brooklyn     1
Engine 331/Ladder 173               158-57 Cross Bay Boulevard  Queens       1
Engine 332/Ladder 175               165 Bradford Street         Brooklyn     1
                                                                            ..
Engine 258/Ladder 115               10-40 47th Avenue           Queens       1
Engine 259/Ladder 128/Battalion 45  33-51 Greenpoint Avenue     Queens       1
Engine 26                           220 West 37th Street        Manhattan    1
Engine 260                          11-15 37th Avenue           Queens       1
Squad 61/Battalion 20               1518 Williamsbridge Road    Bronx        1
Length: 219, dtype: int64

In [14]:
import numpy as np

In [15]:
data.dtype
# view the datatypes of all three attributes

dtype('int64')

In [16]:
data.info('Borough')
#view the fdny information for each borough

<class 'pandas.core.series.Series'>
MultiIndex: 219 entries, ('  Engine 96/Ladder 54', '1689 Story Avenue', 'Bronx') to ('Squad 61/Battalion 20', '1518 Williamsbridge Road', 'Bronx')
Series name: None
Non-Null Count  Dtype
--------------  -----
219 non-null    int64
dtypes: int64(1)
memory usage: 14.5+ KB

In [17]:
data.info("Manhattan")
#view fdny information for manhattan

<class 'pandas.core.series.Series'>
MultiIndex: 219 entries, ('  Engine 96/Ladder 54', '1689 Story Avenue', 'Bronx') to ('Squad 61/Battalion 20', '1518 Williamsbridge Road', 'Bronx')
Series name: None
Non-Null Count  Dtype
--------------  -----
219 non-null    int64
dtypes: int64(1)
memory usage: 14.5+ KB

In [18]:
data.Borough='Manhattan'
data

FacilityName                        FacilityAddress             Borough
  Engine 96/Ladder 54               1689 Story Avenue           Bronx        1
Engine 43/Ladder 59                 1901 Sedgwick Avenue        Bronx        1
Engine 330/Ladder 172               2312 65th Street            Brooklyn     1
Engine 331/Ladder 173               158-57 Cross Bay Boulevard  Queens       1
Engine 332/Ladder 175               165 Bradford Street         Brooklyn     1
                                                                            ..
Engine 258/Ladder 115               10-40 47th Avenue           Queens       1
Engine 259/Ladder 128/Battalion 45  33-51 Greenpoint Avenue     Queens       1
Engine 26                           220 West 37th Street        Manhattan    1
Engine 260                          11-15 37th Avenue           Queens       1
Squad 61/Battalion 20               1518 Williamsbridge Road    Bronx        1
Length: 219, dtype: int64

In [19]:
data.borough='Borough'

In [20]:
data

FacilityName                        FacilityAddress             Borough
  Engine 96/Ladder 54               1689 Story Avenue           Bronx        1
Engine 43/Ladder 59                 1901 Sedgwick Avenue        Bronx        1
Engine 330/Ladder 172               2312 65th Street            Brooklyn     1
Engine 331/Ladder 173               158-57 Cross Bay Boulevard  Queens       1
Engine 332/Ladder 175               165 Bradford Street         Brooklyn     1
                                                                            ..
Engine 258/Ladder 115               10-40 47th Avenue           Queens       1
Engine 259/Ladder 128/Battalion 45  33-51 Greenpoint Avenue     Queens       1
Engine 26                           220 West 37th Street        Manhattan    1
Engine 260                          11-15 37th Avenue           Queens       1
Squad 61/Battalion 20               1518 Williamsbridge Road    Bronx        1
Length: 219, dtype: int64